# UpdaterId Properties

---
The UpdaterId type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
UpdaterId Class
Autodesk.Revit.DB Namespace